<font size="6"><center> <b>Basic data manipulation in R and Python</b></center> </font>


<center><font size="4">This is an attempt to depict the core data manipulation tasks in both **`R`** and **`Python`**.<br>
For the former we will use <mark>dplyr</mark> and <mark>tidyr</mark> for the latter we will use <mark>Pandas</mark> </font></center>

<font size="3">Most of the examples are taken from the `dplyr` vignette and `pandas` documentation</font>

<font size="4">
<u>The basic tasks we will focus on are:</u>
* Loading libraries
* Creating dataframes
* Importing csv
* Filtering by rows and by columns
* Sorting by rows and by columns
* Calculating new columns
* Grouping dataframes
* Sampling dataframes
* From long tables to wide and vice versa
* Joining dataframes

*Only but a few of the possible approaches/solutions are going to be presented*

In [2]:
# So we can run R and python on the same notebook
%load_ext rpy2.ipython

The rpy2.ipython extension is already loaded. To reload it, use:
  %reload_ext rpy2.ipython

<font size="4">Whenever we see the <mark>**%%R**</mark> at the beginning of the cell, the code is in **`R`**, otherwise it's in **`python`**</font>

<hr style="height:4px;border:none;background-color:#bec2c4;" />

<img src="https://www.r-project.org/Rlogo.png" alt="R" style="width: 200px;"/>

<img src="http://blog.klocwork.com/wp-content/uploads/fly-images/10699/python-logo-348x350-c.png" alt="python" style="width: 180px;"/>

<hr style="height:4px;border:none;background-color:#bec2c4;" />

##  Importing libraries

In [3]:
%%R

library(dplyr)
library(tidyr)

In [4]:
# python

import pandas as pd
import numpy as np

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Creating dataframes

In [5]:
%%R -o r_df 

# dont pay attention to the 1st line
r_df <- data.frame(A=c('a', 'a', 'b', 'c'), 
                   B=c(1L, 2L, 3L, 4L))

In [6]:
# python

p_df = pd.DataFrame({'A' : ['a', 'a', 'b', 'c'],
                     'B' : [1, 2, 3, 4]})

In [7]:
# print the R dataframe in notebook via python

r_df

   A  B
1  a  1
2  a  2
3  b  3
4  c  4

In [8]:
# printing the pandas dataFrame

p_df

   A  B
0  a  1
1  a  2
2  b  3
3  c  4

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Importing csv

In [9]:
%%R -o r_df
r_df <- read.csv("flights.csv")

In [10]:
#python
p_df = pd.read_csv("flights.csv")

In [11]:
r_df.head(2)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
1,2013,1,1,517,515,2,830,819,11,UA,1545,N14228,EWR,IAH,227,1400,5,15,2013-01-01 05:00:00
2,2013,1,1,533,529,4,850,830,20,UA,1714,N24211,LGA,IAH,227,1416,5,29,2013-01-01 05:00:00

In [12]:
p_df.head(2)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Filtering

### by rows

In [13]:
%%R -o r_df2

r_df2 <- r_df %>% filter(month == 12, day == 31)
# equivalent to:
# filter(r_df, month == 12, day == 31)

In [14]:
# python

p_df2 = p_df[ (p_df['month'] == 12) & 
              (p_df['day'] == 31) ]

In [15]:
print(r_df2.shape)
r_df2.head(3)

(776, 19)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
1,2013,12,31,13,2359,14,439,437,2,B6,839,N566JB,JFK,BQN,189,1576,23,59,2013-12-31 23:00:00
2,2013,12,31,18,2359,19,449,444,5,DL,412,N713TW,JFK,SJU,192,1598,23,59,2013-12-31 23:00:00
3,2013,12,31,26,2245,101,129,2353,96,B6,108,N374JB,JFK,PWM,50,273,22,45,2013-12-31 22:00:00

In [16]:
print(p_df2.shape)
p_df2.head(3)

(776, 19)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
110520,2013,12,31,13.0,2359,14.0,439.0,437,2.0,B6,839,N566JB,JFK,BQN,189.0,1576,23,59,2013-12-31 23:00:00
110521,2013,12,31,18.0,2359,19.0,449.0,444,5.0,DL,412,N713TW,JFK,SJU,192.0,1598,23,59,2013-12-31 23:00:00
110522,2013,12,31,26.0,2245,101.0,129.0,2353,96.0,B6,108,N374JB,JFK,PWM,50.0,273,22,45,2013-12-31 22:00:00

### by columns

In [17]:
%%R -o r_df2

r_df2 <- r_df %>% select(year, month, day)

In [18]:
# python

p_df2 = p_df[['year', 'month', 'day']]

In [19]:
print(r_df2.shape)
r_df2.head(3)

(336776, 3)

   year  month  day
1  2013      1    1
2  2013      1    1
3  2013      1    1

In [20]:
print(p_df2.shape)
p_df2.head(3)

(336776, 3)

   year  month  day
0  2013      1    1
1  2013      1    1
2  2013      1    1

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Sorting

### by rows

In [21]:
%%R -o r_df2

r_df2 <- r_df %>% 
         arrange(desc(carrier), arr_delay)

In [22]:
# python

p_df2 = p_df.sort_values(by=['carrier','arr_delay'], 
                         ascending=[False, True])

In [23]:
r_df2[['carrier', 'arr_delay']].head(3)

  carrier  arr_delay
1      YV        -46
2      YV        -46
3      YV        -45

In [24]:
p_df2[['carrier', 'arr_delay']].head(3)

      carrier  arr_delay
57321      YV      -46.0
89454      YV      -46.0
27733      YV      -45.0

### by columns

In [25]:
%%R -o r_df2

r_df2 <- r_df[ r_df %>% names() %>% sort() ]  
# is the same as r_df[sort(names(r_df))]

In [26]:
# python

p_df2 = pd.DataFrame(p_df,
                     columns=sorted(p_df.columns))

In [27]:
r_df2.head(1)

,air_time,arr_delay,arr_time,carrier,day,dep_delay,dep_time,dest,distance,flight,hour,minute,month,origin,sched_arr_time,sched_dep_time,tailnum,time_hour,year
1,227,11,830,UA,1,2,517,IAH,1400,1545,5,15,1,EWR,819,515,N14228,2013-01-01 05:00:00,2013

In [28]:
p_df2.head(1)

,air_time,arr_delay,arr_time,carrier,day,dep_delay,dep_time,dest,distance,flight,hour,minute,month,origin,sched_arr_time,sched_dep_time,tailnum,time_hour,year
0,227.0,11.0,830.0,UA,1,2.0,517.0,IAH,1400,1545,5,15,1,EWR,819,515,N14228,2013-01-01 05:00:00,2013

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Calculating new columns

### Example 1

In [29]:
%%R -o r_df2


r_df2 <- r_df %>% 
  mutate(gain = arr_delay - dep_delay,  
        gain_per_hour =  gain / (air_time / 60))

In [30]:
# python

p_df2 = p_df.copy()
p_df2['gain'] = (p_df2['arr_delay'] - 
                 p_df2['dep_delay'])
    
p_df2['gain_per_hour'] = ( p_df2['gain'] / 
                    (p_df2['air_time'] / 60) )

In [31]:
r_df2[['year', 'carrier', 'arr_delay', 
       'dep_delay', 'gain', 'air_time', 
       'gain_per_hour']].head(3)

   year carrier  arr_delay  dep_delay  gain  air_time  gain_per_hour
1  2013      UA         11          2     9       227       2.378855
2  2013      UA         20          4    16       227       4.229075
3  2013      AA         33          2    31       160      11.625000

In [32]:
p_df2[['year', 'carrier', 'arr_delay', 
       'dep_delay', 'gain', 'air_time', 
       'gain_per_hour']].head(3)

   year carrier  arr_delay  dep_delay  gain  air_time  gain_per_hour
0  2013      UA       11.0        2.0   9.0     227.0       2.378855
1  2013      UA       20.0        4.0  16.0     227.0       4.229075
2  2013      AA       33.0        2.0  31.0     160.0      11.625000

<hr style="height:2px;border:none;background-color:#bec2c4;" />

In [33]:
# Lets create a new dataFrame
df = pd.DataFrame({'month' : ['Feb', 'Feb', 'Feb', 'Mar', 'Mar', 'Mar', 'Mar', 'Apr', 'May', 'May'],
                     'type' : ['a', 'b', 'c', 'a', 'b', 'c', 'd', 'a', 'a', 'b'], 
                     'sales' : [10, 20, 30, 40, 10, 20, 30, 40, 30, 20]})
df = df[['month', 'type', 'sales']].sort_values(by=['month', 'type'], ascending=[0,1])
df.head(5)

  month type  sales
8   May    a     30
9   May    b     20
3   Mar    a     40
4   Mar    b     10
5   Mar    c     20

<hr style="height:2px;border:none;background-color:#bec2c4;" />

### Example 2

<font size="4">Lets put the `$` sign in the `sales` column</font>

In [34]:
%%R -i df -o r_df2

r_df2 <- df %>% 
         mutate(sales = paste0(sales, "$")) %>%
         as.data.frame()

In [35]:
# python

p_df2 = df.copy()
p_df2['sales'] = (
    p_df2['sales'].map(lambda x: str(x) + "$") )

In [36]:
r_df2.head(2)

  month type sales
1   May    a   30$
2   May    b   20$

In [37]:
p_df2.head(2)

  month type sales
8   May    a   30$
9   May    b   20$

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Manipulation on Grouped Data

### Grouping and reducing the table size

In [38]:
%%R -o r_df2

r_df2 <- r_df %>% group_by(tailnum) %>% 
  summarise(count = n(), 
            dist = mean(distance, na.rm = TRUE),
            delay = mean(arr_delay, na.rm = TRUE)) %>%
  as.data.frame()

# r_df %>% group_by(tailnum, year, month) ...
# for more than one group column

In [39]:
# python

p_df2 = p_df.groupby('tailnum').agg(
    {'distance': ['count', 'mean'], 
     'arr_delay': 'mean'}).reset_index()

# p_df.groupby(['tailnum', 'year', 'month']) ...
# for more than one column

p_df2.columns = ['tailnum', 'count', 
                 'dist', 'delay']

In [40]:
print('Initial size: ' + str(r_df.shape))
print('After grouping: ' + str(r_df2.shape))
r_df2.tail(3)

Initial size: (336776, 19)
After grouping: (4044, 4)

     tailnum  count        dist      delay
4042  N999DN     61  895.459016  14.311475
4043  N9EAMQ    248  674.665323   9.235294
4044  D942DN   2512  710.257564        NaN

In [41]:
print('Initial size: ' + str(p_df.shape))
print('After grouping: ' + str(p_df2.shape))
p_df2.tail(3)

Initial size: (336776, 19)
After grouping: (4043, 4)

     tailnum  count        dist      delay
4040  N998DL     77  857.818182  16.394737
4041  N999DN     61  895.459016  14.311475
4042  N9EAMQ    248  674.665323   9.235294

\* *in R the last tailnum in NA (there seems to be some issue when moving dataFrame from R to python)*

<br><br><br><br>
<br><br><br>




<font size="4">
We are going to replace the `NaN` values in<br>
pandas DataFrame to the string `NULL` and rerun
</font>

In [42]:
p_df2 = p_df.copy()
p_df2['tailnum'].fillna('NULL', inplace=True)

p_df2 = p_df2.groupby('tailnum').agg(
    {'distance': ['count', 'mean'], 
     'arr_delay': ['mean']}).reset_index()

p_df2.columns = ['tailnum', 'count', 
                 'dist', 'delay']
print(p_df2.shape)
p_df2.tail(3)

(4044, 4)

     tailnum  count        dist      delay
4041  N999DN     61  895.459016  14.311475
4042  N9EAMQ    248  674.665323   9.235294
4043    NULL   2512  710.257564        NaN

<hr style="height:4px;border:none;background-color:#bec2c4;" />

### Grouping and preserving the data frame

#### example 1

In [43]:
df

  month type  sales
8   May    a     30
9   May    b     20
3   Mar    a     40
4   Mar    b     10
5   Mar    c     20
6   Mar    d     30
0   Feb    a     10
1   Feb    b     20
2   Feb    c     30
7   Apr    a     40

In [44]:
%%R -i df -o r_df

r_df <- df %>% group_by(month) %>% 
  mutate(weight_prc = 
            round(sales/sum(sales)*100,2 )) %>%
  as.data.frame()

In [45]:
# python

p_df = df.copy()
p_df['weight_prc'] = (
    p_df.groupby('month')['sales'].transform(
        lambda x: round(x/sum(x)*100, 2))  )

In [46]:
r_df

   month type  sales  weight_prc
1    May    a     30       60.00
2    May    b     20       40.00
3    Mar    a     40       40.00
4    Mar    b     10       10.00
5    Mar    c     20       20.00
6    Mar    d     30       30.00
7    Feb    a     10       16.67
8    Feb    b     20       33.33
9    Feb    c     30       50.00
10   Apr    a     40      100.00

In [47]:
p_df

  month type  sales  weight_prc
8   May    a     30       60.00
9   May    b     20       40.00
3   Mar    a     40       40.00
4   Mar    b     10       10.00
5   Mar    c     20       20.00
6   Mar    d     30       30.00
0   Feb    a     10       16.67
1   Feb    b     20       33.33
2   Feb    c     30       50.00
7   Apr    a     40      100.00

#### example 2

In [48]:
%%R -i df -o r_df


r_df <- df %>% group_by(month) %>% 
   mutate(weight_prc = 
      round(sales/sum(sales)*100,2 ), 
      range = max(sales) - min(sales), 
    sales_rank = as.integer(rank(sales))) %>% 
  as.data.frame()

In [49]:
# python

p_df = df.copy()
grouped = p_df.groupby('month')
p_df['weight_prc'] = ( 
    grouped['sales'].transform(
        lambda x: round(x/sum(x)*100, 2)) )

p_df['range'] = ( grouped['sales'].transform(
                lambda x: x.max() - x.min()))

p_df['sales_rnk'] = (
 grouped['sales'].transform(lambda x: x.rank()))

In [50]:
r_df

   month type  sales  weight_prc  range  sales_rank
1    May    a     30       60.00   10.0           2
2    May    b     20       40.00   10.0           1
3    Mar    a     40       40.00   30.0           4
4    Mar    b     10       10.00   30.0           1
5    Mar    c     20       20.00   30.0           2
6    Mar    d     30       30.00   30.0           3
7    Feb    a     10       16.67   20.0           1
8    Feb    b     20       33.33   20.0           2
9    Feb    c     30       50.00   20.0           3
10   Apr    a     40      100.00    0.0           1

In [51]:
p_df

  month type  sales  weight_prc  range  sales_rnk
8   May    a     30       60.00     10          2
9   May    b     20       40.00     10          1
3   Mar    a     40       40.00     30          4
4   Mar    b     10       10.00     30          1
5   Mar    c     20       20.00     30          2
6   Mar    d     30       30.00     30          3
0   Feb    a     10       16.67     20          1
1   Feb    b     20       33.33     20          2
2   Feb    c     30       50.00     20          3
7   Apr    a     40      100.00      0          1

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Sampling rows from data frame

In [52]:
%%R -i df -o r_df

r_df <- df %>% slice(sample(1:ncol(df), 3)) %>%
            as.data.frame()

In [53]:
# python

p_df = df.copy()
p_df = p_df.sample(n=3)

In [54]:
r_df

  month type  sales
1   Mar    a     40
2   May    a     30
3   May    b     20

In [55]:
p_df

  month type  sales
2   Feb    c     30
1   Feb    b     20
9   May    b     20

## From long tables to wide and vice versa

### Wide to long

In [56]:
# Example taken from https://blog.rstudio.com/2014/07/22/introducing-tidyr/
wide = pd.DataFrame({'name' : ["Wilbur", "Petunia", "Gregory"], 'a' : [67, 80, 64], 'b' : [56, 90, 50]})
wide = wide[['name', 'a', 'b']]
wide

      name   a   b
0   Wilbur  67  56
1  Petunia  80  90
2  Gregory  64  50

In [57]:
%%R -i wide -o r_long

r_long <- wide %>% 
              gather(drug, heartrate, a, b) %>%
              as.data.frame()

In [58]:
# python

p_long = pd.melt(wide, id_vars=['name'], 
                 value_vars=['a', 'b'], 
                 var_name='drug', 
                 value_name='heartrate')

In [59]:
r_long

      name drug  heartrate
1   Wilbur    a         67
2  Petunia    a         80
3  Gregory    a         64
4   Wilbur    b         56
5  Petunia    b         90
6  Gregory    b         50

In [60]:
p_long

      name drug  heartrate
0   Wilbur    a         67
1  Petunia    a         80
2  Gregory    a         64
3   Wilbur    b         56
4  Petunia    b         90
5  Gregory    b         50

### Long to wide

In [61]:
%%R -o r_wide

r_wide <- r_long %>% 
    spread(drug, heartrate) %>% as.data.frame()

In [62]:
# python

p_wide = p_long.set_index(['name', 
               'drug']).unstack().reset_index()
p_wide.columns = ['name', 'a', 'b']

# or   
# p_wide = p_long.pivot_table(index=['name'], 
#           columns='drug', values='heartrate')
# p_wide.columns = list(p_wide.columns)
# p_wide = p_wide.reset_index()

In [63]:
r_wide

      name   a   b
1  Gregory  64  50
2  Petunia  80  90
3   Wilbur  67  56

In [64]:
p_wide

      name   a   b
0  Gregory  64  50
1  Petunia  80  90
2   Wilbur  67  56

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Joining DataFrames

In [65]:
# example taken from https://pandas.pydata.org/pandas-docs/stable/merging.html
left = pd.DataFrame({'key1_left': ['K0', 'K0', 'K1', 'K2'],
                     'key2_left': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1_right': ['K0', 'K1', 'K1', 'K2'],
                      'key2_right': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [66]:
left

    A   B key1_left key2_left
0  A0  B0        K0        K0
1  A1  B1        K0        K1
2  A2  B2        K1        K0
3  A3  B3        K2        K1

In [67]:
right

    C   D key1_right key2_right
0  C0  D0         K0         K0
1  C1  D1         K1         K0
2  C2  D2         K1         K0
3  C3  D3         K2         K0

In [68]:
%%R -i left -i right -o r_df

r_df <- inner_join(left, right, 
        by = c("key1_left" = "key1_right", 
               "key2_left" = "key2_right")) %>%
        as.data.frame()

In [69]:
# python

p_df = pd.merge(left, right, 
        left_on=['key1_left', 'key2_left'], 
        right_on=['key1_right', 'key2_right'])

In [70]:
r_df

    A   B key1_left key2_left   C   D
1  A0  B0        K0        K0  C0  D0
2  A2  B2        K1        K0  C1  D1
3  A2  B2        K1        K0  C2  D2

In [71]:
p_df

    A   B key1_left key2_left   C   D key1_right key2_right
0  A0  B0        K0        K0  C0  D0         K0         K0
1  A2  B2        K1        K0  C1  D1         K1         K0
2  A2  B2        K1        K0  C2  D2         K1         K0

<hr style="height:4px;border:none;background-color:#bec2c4;" />

## Help to the rescue

### Pulling up help documentation

In [72]:
%%R

?inner_join

In [73]:
# pyhton

pd.merge?

### View source code

In [74]:
%%R

inner_join

In [75]:
# python

pd.merge??